Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: والأرض مددناها وألقينا فيها رواسي وأنبتنا فيها من كل شيء موزون
en: And the earth We have spread out, and have placed therein firm mountains, and caused to grow therein all kinds of things in due proportion.

source: وجعلنا لكم فيها معايش ومن لستم له برازقين
en: And We have provided therein means of living, for you and for those whom you provide not [moving (living) creatures, cattle, beasts, and other animals].

source: وإن من شيء إلا عندنا خزائنه وما ننزله إلا بقدر معلوم
en: And there is not a thing, but with Us are the stores thereof. And We send it not down except in a known measure.

source: وأرسلنا الرياح لواقح فأنزلنا من السماء ماء فأسقيناكموه وما أنتم له بخازنين
en: And We send the winds fertilizing (to fill heavily the clouds with water), then cause the water (rain) to descend from the sky, and We give it to you to drink, and it is not you who are the owners of its stores [i.e. to give water to whom you like or to withhold it from whom you like].

source: وإنا لنحن نحيي ونميت ونحن الوارثون
en: And certainly We! We it is Who give life, and cause death, and We are the Inheritors.

source: ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين
en: And indeed, We know the first generations of you who had passed away, and indeed, We know the present generations of you (mankind), and also those who will come afterwards.

source: وإن ربك هو يحشرهم إنه حكيم عليم
en: And verily, your Lord will gather them together. Truly, He is All-Wise, All-Knowing.

source: ولقد خلقنا الإنسان من صلصال من حمإ مسنون
en: And indeed, We created man from dried (sounding) clay of altered mud.

source: والجان خلقناه من قبل من نار السموم
en: And the jinn, We created aforetime from the smokeless flame of fire.

source: وإذ قال ربك للملائكة إني خالق بشرا من صلصال من حمإ مسنون
en: And (remember) when your Lord said to the angels: "I am going to create a man (Adam) from dried (sounding) clay of altered mud.

source: فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين
en: "So, when I have fashioned him completely and breathed into him (Adam) the soul which I created for him, then fall (you) down prostrating yourselves unto him."

source: فسجد الملائكة كلهم أجمعون
en: So the angels prostrated themselves, all of them together.

source: إلا إبليس أبى أن يكون مع الساجدين
en: Except Iblis (Satan) - he refused to be among the prostrators.

source: قال يا إبليس ما لك ألا تكون مع الساجدين
en: (Allah) said: "O Iblis (Satan)! What is your reason for not being among the prostrators?"

source: قال لم أكن لأسجد لبشر خلقته من صلصال من حمإ مسنون
en: [Iblis (Satan)] said: "I am not the one to prostrate myself to a human being, whom You created from dried (sounding) clay of altered mud."

source: قال فاخرج منها فإنك رجيم
en: (Allah) said: "Then, get out from here, for verily, you are Rajim (an outcast or a cursed one)." [Tafsir At-Tabari]

source: وإن عليك اللعنة إلى يوم الدين
en: "And verily, the curse shall be upon you till the Day of Recompense (i.e. the Day of Resurrection)."

source: قال رب فأنظرني إلى يوم يبعثون
en: [Iblis (Satan)] said: "O my Lord! Give me then respite till the Day they (the dead) will be resurrected."

source: قال فإنك من المنظرين
en: Allah said: "Then, verily, you are of those reprieved,

source: إلى يوم الوقت المعلوم
en: "Till the Day of the time appointed."

source: قال رب بما أغويتني لأزينن لهم في الأرض ولأغوينهم أجمعين
en: [Iblis (Satan)] said: "O my Lord! Because you misled me, I shall indeed adorn the path of error for them (mankind) on the earth, and I shall mislead them all.

source: إلا عبادك منهم المخلصين
en: "Except Your chosen, (guided) slaves among them."

source: قال هذا صراط علي مستقيم
en: (Allah) said: "This is the Way which will lead straight to Me."

source: إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين
en: "Certainly, you shall have no authority over My slaves, except those who follow you of the Ghawun (Mushrikun and those who go astray, criminals, polytheists, and evil-doers).

source: وإن جهنم لموعدهم أجمعين
en: "And surely, Hell is the promised place for them all.

source: لها سبعة أبواب لكل باب منهم جزء مقسوم
en: "It (Hell) has seven gates, for each of those gates is a (special) class (of sinners) assigned.

source: إن المتقين في جنات وعيون
en: "Truly! The Muttaqun (the pious - See V.2:2) will be amidst Gardens and water-springs (Paradise).

source: ادخلوها بسلام آمنين
en: "(It will be said to them): 'Enter therein (Paradise), in peace and security.'

source: ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين
en: "And We shall remove from their breasts any deep feeling of bitterness (that they may have). (So they will be like) brothers facing each other on thrones.

source: لا يمسهم فيها نصب وما هم منها بمخرجين
en: "No sense of fatigue shall touch them, nor shall they (ever) be asked to leave it."

source: نبئ عبادي أني أنا الغفور الرحيم
en: Declare (O Muhammad صلى الله عليه و سلم) unto My slaves, that truly, I am the Oft-Forgiving, the Most-Merciful.

source: وأن عذابي هو العذاب الأليم
en: And that My Torment is indeed the most painful torment.

source: ونبئهم عن ضيف إبراهيم
en: And tell them about the guests (the angels) of Ibrahim (Abraham).

source: إذ دخلوا عليه فقالوا سلاما قال إنا منكم وجلون
en: When they entered unto him, and said: Salam (peace)! [Ibrahim (Abraham)] said: "Indeed! We are afraid of you."

source: قالوا لا توجل إنا نبشرك بغلام عليم
en: They (the angels) said: "Do not be afraid! We give you glad tidings of a boy (son) possessing much knowledge and wisdom."

source: قال أبشرتموني على أن مسني الكبر فبم تبشرون
en: [Ibrahim (Abraham)] said: "Do you give me glad tidings (of a son) when old age has overtaken me? Of what then is your news?"

source: قالوا بشرناك بالحق فلا تكن من القانطين
en: They (the angels) said: "We give you glad tidings in truth. So be not of the despairing."

source: قال ومن يقنط من رحمة ربه إلا الضالون
en: [Ibrahim (Abraham)] said: "And who despairs of the Mercy of his Lord except those who are astray?"

source: قال فما خطبكم أيها المرسلون
en: [Ibrahim (Abraham) again] said: "What then is the business on which you have come, O Messengers?"

source: قالوا إنا أرسلنا إلى قوم مجرمين
en: They (the angels) said: "We have been sent to a people who are Mujrimun (criminals, disbelievers, polytheists, sinners).

source: إلا آل لوط إنا لمنجوهم أجمعين
en: "(All) except the family of Lut (Lot). Them all we are surely going to save (from destruction).

source: إلا امرأته قدرنا إنها لمن الغابرين
en: "Except his wife, of whom We have decreed that she shall be of those who remain behind (i.e. she will be destroyed)."

source: فلما جاء آل لوط المرسلون
en: Then, when the Messengers (the angels) came unto the family of Lut (Lot).

source: قال إنكم قوم منكرون
en: He said: "Verily! You are people unknown to me."

source: قالوا بل جئناك بما كانوا فيه يمترون
en: They said: "Nay, we have come to you with that (torment) which they have been doubting.

source: وأتيناك بالحق وإنا لصادقون
en: "And we have brought you the truth (the news of the destruction of your nation) and certainly, we tell the truth.

source: فأسر بأهلك بقطع من الليل واتبع أدبارهم ولا يلتفت منكم أحد وامضوا حيث تؤمرون
en: "Then travel in a part of the night with your family, and you go behind them in the rear, and let no one amongst you look back, but go on to where you are ordered."

source: وقضينا إليه ذلك الأمر أن دابر هؤلاء مقطوع مصبحين
en: And We made known this decree to him, that the root of those (sinners) was to be cut off in the early morning.

source: وجاء أهل المدينة يستبشرون
en: And the inhabitants of the city came rejoicing (at the news of the young men's arrival).

source: قال إن هؤلاء ضيفي فلا تفضحون
en: [Lut (Lot)] said: "Verily! these are my guests, so shame me not.

source: واتقوا الله ولا تخزون
en: "And fear Allah and disgrace me not."

source: قالوا أولم ننهك عن العالمين
en: They (people of the city) said: "Did we not forbid you from entertaining (or protecting) any of the 'Alamin (people, foreigners and strangers from us)?"

source: قال هؤلاء بناتي إن كنتم فاعلين
en: [Lut (Lot)] said: "These (the girls of the nation) are my daughters (to marry lawfully), if you must act (so)."

source: لعمرك إنهم لفي سكرتهم يعمهون
en: Verily, by your life (O Muhammad صلى الله عليه و سلم), in their wild intoxication, they were wandering blindly.

source: فأخذتهم الصيحة مشرقين
en: So As-Saihah (torment - awful cry) overtook them at the time of sunrise.

source: فجعلنا عاليها سافلها وأمطرنا عليهم حجارة من سجيل
en: And We turned (the towns of Sodom in Palestine) upside down and rained down on them stones of baked clay.

source: إن في ذلك لآيات للمتوسمين
en: Surely! In this are signs for those who see (or understand or learn the lessons from the Signs of Allah).

source: وإنها لبسبيل مقيم
en: And verily! They (the cities) were right on the highroad (from Makkah to Syria i.e. the place where the Dead Sea is now) .

source: إن في ذلك لآية للمؤمنين
en: Surely! Therein is indeed a sign for the believers.

source: وإن كان أصحاب الأيكة لظالمين
en: And the Dwellers in the Wood [i.e. the people of Madyan (Midian) to whom Prophet Shu'aib (عليه السلام) was sent by Allah), were also Zalimun (polytheists and wrong-doers).

source: فانتقمنا منهم وإنهما لبإمام مبين
en: So, We took vengeance on them. They are both on an open highway, plain to see.

source: ولقد كذب أصحاب الحجر المرسلين
en: And verily, the dwellers of Al-Hijr (the rocky tract) denied the Messengers.

source: وآتيناهم آياتنا فكانوا عنها معرضين
en: And We gave them Our Signs, but they were averse to them.

source: وكانوا ينحتون من الجبال بيوتا آمنين
en: And they used to hew out dwellings from the mountains (feeling themselves) secure.

source: فأخذتهم الصيحة مصبحين
en: But As-Saihah (torment - awful cry) overtook them in the early morning (of the fourth day of their promised punishment days).

source: فما أغنى عنهم ما كانوا يكسبون
en: And all that they used to earn availed them not.

source: وما خلقنا السماوات والأرض وما بينهما إلا بالحق وإن الساعة لآتية فاصفح الصفح الجميل
en: And We created not the heavens and the earth and all that is between them except with truth, and the Hour is surely coming, so overlook (O Muhammad صلى الله عليه و سلم) their faults with gracious forgiveness. [This was before the ordainment of Jihad - holy fighting in Allah's cause].

source: إن ربك هو الخلاق العليم
en: Verily, your Lord is the All-Knowing Creator.

source: ولقد آتيناك سبعا من المثاني والقرآن العظيم
en: And indeed, We have bestowed upon you seven of Al-Mathani (seven repeatedly recited Verses), (i.e. Surat Al-Fatihah) and the Grand Qur'an.

source: لا تمدن عينيك إلى ما متعنا به أزواجا منهم ولا تحزن عليهم واخفض جناحك للمؤمنين
en: Look not with your eyes ambitiously at what We have bestowed on certain classes of them (the disbelievers), nor grieve over them. And lower your wings for the believers (be courteous to the fellow-believers).

source: وقل إني أنا النذير المبين
en: And say (O Muhammad صلى الله عليه و سلم): "I am indeed a plain warner."

source: كما أنزلنا على المقتسمين
en: As We have sent down on the dividers, (Quraish pagans or Jews and Christians).

source: الذين جعلوا القرآن عضين
en: Who have made the Qur'an into parts. (i.e. believed in one part and disbelieved in the other). [Tafsir At-Tabari]

source: فوربك لنسألنهم أجمعين
en: So, by your Lord (O Muhammad صلى الله عليه و سلم), We shall certainly call all of them to account.

source: عما كانوا يعملون
en: For all that they used to do.

source: فاصدع بما تؤمر وأعرض عن المشركين
en: Therefore proclaim openly (Allah's Message - Islamic Monotheism) that which you are commanded, and turn away from Al-Mushrikun (polytheists, idolaters, and disbelievers - See V.2:105).

source: إنا كفيناك المستهزئين
en: Truly! We will suffice you against the scoffers,

source: الذين يجعلون مع الله إلها آخر فسوف يعلمون
en: Who set up along with Allah another ilah (god); but they will come to know.

source: ولقد نعلم أنك يضيق صدرك بما يقولون
en: Indeed, We know that your breast is straitened at what they say.

source: فسبح بحمد ربك وكن من الساجدين
en: So glorify the praises of your Lord and be of those who prostrate themselves (to Him).

source: واعبد ربك حتى يأتيك اليقين
en: And worship your Lord until there comes unto you the certainty (i.e. death).

source: أتى أمر الله فلا تستعجلوه سبحانه وتعالى عما يشركون
en: The Event (the Hour or the punishment of disbelievers and polytheists or the Islamic laws or commandments) ordained by Allah will come to pass, so seek not to hasten it. Glorified and Exalted be He above all that they associate as partners with Him.

source: ينزل الملائكة بالروح من أمره على من يشاء من عباده أن أنذروا أنه لا إله إلا أنا فاتقون
en: He sends down the angels with the Ruh (revelation) of His Command to whom of His slaves He wills (saying): "Warn mankind that La ilaha illa Ana (none has the right to be worshipped but I), so fear Me (by abstaining from sins and evil deeds).

source: خلق السماوات والأرض بالحق تعالى عما يشركون
en: He has created the heavens and the earth with truth. High is He, Exalted above all that they associate as partners with Him.

source: خلق الإنسان من نطفة فإذا هو خصيم مبين
en: He has created man from Nutfah (mixed drops of male and female sexual discharge), then behold, this same (man) becomes an open opponent.

source: والأنعام خلقها لكم فيها دفء ومنافع ومنها تأكلون
en: And the cattle, He has created them for you; in them there is warmth (warm clothing), and numerous benefits, and of them you eat.

source: ولكم فيها جمال حين تريحون وحين تسرحون
en: And wherein is beauty for you, when you bring them home in the evening, and as you lead them forth to pasture in the morning.

source: وتحمل أثقالكم إلى بلد لم تكونوا بالغيه إلا بشق الأنفس إن ربكم لرءوف رحيم
en: And they carry your loads to a land that you could not reach except with great trouble to yourselves. Truly, your Lord is full of Kindness, Most Merciful.

source: والخيل والبغال والحمير لتركبوها وزينة ويخلق ما لا تعلمون
en: And (He has created) horses, mules and donkeys, for you to ride and as an adornment. And He creates (other) things of which you have no knowledge.

source: وعلى الله قصد السبيل ومنها جائر ولو شاء لهداكم أجمعين
en: And upon Allah is the responsibility to explain the Straight Path . But there are ways that turn aside (such as Paganism, Judaism and Christianity). And had He willed, He would have guided you all (mankind).

source: هو الذي أنزل من السماء ماء لكم منه شراب ومنه شجر فيه تسيمون
en: He it is Who sends down water (rain) from the sky; from it you drink and from it (grows) the vegetation on which you send your cattle to pasture.

source: ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات إن في ذلك لآية لقوم يتفكرون
en: With it He causes to grow for you the crops, the olives, the date-palms, the grapes, and every kind of fruit. Verily! In this is indeed an evident proof and a manifest sign for people who give thought.

source: وسخر لكم الليل والنهار والشمس والقمر والنجوم مسخرات بأمره إن في ذلك لآيات لقوم يعقلون
en: And He has subjected to you the night and the day, and the sun and the moon; and the stars are subjected by His Command. Surely, in this are proofs for people who understand.

source: وما ذرأ لكم في الأرض مختلفا ألوانه إن في ذلك لآية لقوم يذكرون
en: And whatsoever He has created for you on the earth of varying colours [and qualities from vegetation and fruits (botanical life) and from animals (zoological life)] Verily! In this is a sign for people who remember.

source: وهو الذي سخر البحر لتأكلوا منه لحما طريا وتستخرجوا منه حلية تلبسونها وترى الفلك مواخر فيه ولتبتغوا من فضله ولعلكم تشكرون
en: And He it is Who has subjected the sea (to you), that you eat thereof fresh tender meat (i.e. fish), and that you bring forth out of it ornaments to wear. And you see the ships ploughing through it, that you may seek (thus) of His Bounty (by transporting the goods from place to place) and that you may be grateful.

source: وألقى في الأرض رواسي أن تميد بكم وأنهارا وسبلا لعلكم تهتدون
en: And He has affixed into the earth mountains standing firm, lest it should shake with you; and rivers and roads, that you may guide yourselves.

source: وعلامات وبالنجم هم يهتدون
en: And landmarks (signposts during the day) and by the stars (during the night), they (mankind) guide themselves.

source: أفمن يخلق كمن لا يخلق أفلا تذكرون
en: Is then He, Who creates as one who creates not? Will you not then remember?

source: وإن تعدوا نعمة الله لا تحصوها إن الله لغفور رحيم
en: And if you would count the favours of Allah, never could you be able to count them. Truly! Allah is Oft-Forgiving, Most Merciful.

source: والله يعلم ما تسرون وما تعلنون
en: And Allah knows what you conceal and what you reveal.

source: والذين يدعون من دون الله لا يخلقون شيئا وهم يخلقون
en: Those whom they (Al-Mushrikun ) invoke besides Allah have not created anything, but are themselves created.

source: أموات غير أحياء وما يشعرون أيان يبعثون
en: (They are) dead, not alive; and they know not when they will be raised up.

source: إلهكم إله واحد فالذين لا يؤمنون بالآخرة قلوبهم منكرة وهم مستكبرون
en: Your Ilah (God) is One Ilah (God - Allah, none has the right to be worshipped but He). But for those who believe not in the Hereafter, their hearts deny (the faith in the Oneness of Allah), and they are proud.

source: لا جرم أن الله يعلم ما يسرون وما يعلنون إنه لا يحب المستكبرين
en: Certainly, Allah knows what they conceal and what they reveal. Truly, He likes not the proud.

source: وإذا قيل لهم ماذا أنزل ربكم قالوا أساطير الأولين
en: And when it is said to them: "What is it that your Lord has sent down (unto Muhammad صلى الله عليه و سلم)?" They say: "Tales of the men of old!"

source: ليحملوا أوزارهم كاملة يوم القيامة ومن أوزار الذين يضلونهم بغير علم ألا ساء ما يزرون
en: They may bear their own burdens in full on the Day of Resurrection, and also of the burdens of those whom they misled without knowledge. Evil indeed is that which they shall bear!

source: قد مكر الذين من قبلهم فأتى الله بنيانهم من القواعد فخر عليهم السقف من فوقهم وأتاهم العذاب من حيث لا يشعرون
en: Those before them indeed plotted, but Allah struck at the foundation of their building, and then the roof fell down upon them, from above them, and the torment overtook them from directions they did not perceive.

source: ثم يوم القيامة يخزيهم ويقول أين شركائي الذين كنتم تشاقون فيهم قال الذين أوتوا العلم إن الخزي اليوم والسوء على الكافرين
en: Then, on the Day of Resurrection, He will disgrace them and will say: "Where are My (so called) partners concerning whom you used to disagree and dispute (with the believers, by defying and disobeying Allah)?" Those who have been given the knowledge (about the Torment of Allah for the disbelievers) will say: "Verily! Disgrace and misery this Day are upon the disbelievers.

source: الذين تتوفاهم الملائكة ظالمي أنفسهم فألقوا السلم ما كنا نعمل من سوء بلى إن الله عليم بما كنتم تعملون
en: "Those whose lives the angels take while they are doing wrong to themselves (by disbelief and by associating partners in worship with Allah and by committing all kinds of crimes and evil deeds)." Then, they will make (false) submission (saying): "We used not to do any evil." (The angels will reply): "Yes! Truly, Allah is All-Knower of what you used to do.

source: فادخلوا أبواب جهنم خالدين فيها فلبئس مثوى المتكبرين
en: "So enter the gates of Hell, to abide therein, and indeed, what an evil abode will be for the arrogant."

source: وقيل للذين اتقوا ماذا أنزل ربكم قالوا خيرا للذين أحسنوا في هذه الدنيا حسنة ولدار الآخرة خير ولنعم دار المتقين
en: And (when) it is said to those who are the Muttaqun (the pious - See V.2:2) "What is it that your Lord has sent down?" They say: "That which is good." For those who do good in this world, there is good, and the home of the Hereafter will be better. And excellent indeed will be the home (i.e. Paradise) of the Muttaqun (the pious - See V.2:2).

source: جنات عدن يدخلونها تجري من تحتها الأنهار لهم فيها ما يشاءون كذلك يجزي الله المتقين
en: 'Adn (Eden) Paradise (Gardens of Eternity) which they will enter, under which rivers flow, they will have therein all that they wish. Thus Allah rewards the Muttaqun (the pious - See V.2:2).

source: الذين تتوفاهم الملائكة طيبين يقولون سلام عليكم ادخلوا الجنة بما كنتم تعملون
en: Those whose lives the angels take while they are in a pious state (i.e. pure from all evil, and worshipping none but Allah Alone) saying (to them): Salamun 'Alaikum (peace be on you) enter you Paradise, because of that (the good) which you used to do (in the world)."

source: هل ينظرون إلا أن تأتيهم الملائكة أو يأتي أمر ربك كذلك فعل الذين من قبلهم وما ظلمهم الله ولكن كانوا أنفسهم يظلمون
en: Do they (the disbelievers and polytheists) await but that the angels should come to them [to take away their souls (at death)], or there should come the command (i.e. the torment or the Day of Resurrection) of your Lord? Thus did those before them. And Allah wronged them not, but they used to wrong themselves.

source: فأصابهم سيئات ما عملوا وحاق بهم ما كانوا به يستهزئون
en: Then, the evil results of their deeds overtook them, and that at which they used to mock at surrounded them.

source: وقال الذين أشركوا لو شاء الله ما عبدنا من دونه من شيء نحن ولا آباؤنا ولا حرمنا من دونه من شيء كذلك فعل الذين من قبلهم فهل على الرسل إلا البلاغ المبين
en: And those who joined others in worship with Allah said: "If Allah had so willed, neither we nor our fathers would have worshipped aught but Him, nor would we have forbidden anything without (Command from) Him." So did those before them. Then! Are the Messengers charged with anything but to convey clearly the Message?

source: ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت فمنهم من هدى الله ومنهم من حقت عليه الضلالة فسيروا في الأرض فانظروا كيف كان عاقبة المكذبين
en: And verily, We have sent among every Ummah (community, nation) a Messenger (proclaiming): "Worship Allah (Alone), and avoid (or keep away from) Taghut (all false deities i.e. do not worship Taghut besides Allah)." Then of them were some whom Allah guided and of them were some upon whom the straying was justified. So travel through the land and see what was the end of those who denied (the truth).

source: إن تحرص على هداهم فإن الله لا يهدي من يضل وما لهم من ناصرين
en: If you (O Muhammad صلى الله عليه و سلم) covet for their guidance, then verily Allah guides not those whom He makes to go astray (or none can guide him whom Allah sends astray). And they will have no helpers.

source: وأقسموا بالله جهد أيمانهم لا يبعث الله من يموت بلى وعدا عليه حقا ولكن أكثر الناس لا يعلمون
en: And they swear by Allah their strongest oaths, that Allah will not raise up him who dies. Yes, (He will raise them up), - a promise (binding) upon Him in truth, but most of mankind know not.

source: ليبين لهم الذي يختلفون فيه وليعلم الذين كفروا أنهم كانوا كاذبين
en: In order that He may make manifest to them the truth of that wherein they differ, and that those who disbelieved (in Resurrection, and in the Oneness of Allah) may know that they were liars.

source: إنما قولنا لشيء إذا أردناه أن نقول له كن فيكون
en: Verily! Our Word unto a thing when We intend it, is only that We say unto it: "Be!" - and it is.

source: والذين هاجروا في الله من بعد ما ظلموا لنبوئنهم في الدنيا حسنة ولأجر الآخرة أكبر لو كانوا يعلمون
en: And as for those who emigrated for the Cause of Allah, after they had been wronged, We will certainly give them goodly residence in this world, but indeed the reward of the Hereafter will be greater; if they but knew!

source: الذين صبروا وعلى ربهم يتوكلون
en: (They are) those who remained patient (in this world for Allah's sake), and put their trust in their Lord (Allah Alone).
